nxp-appcodehub/dm-p3h2x4x-i3c-hub-demo-application/p3h2x4x_demo_app/frdmmcxn947_p3h2x4x_demoapp/board/pin_mux.c
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/

void LPI3C_InitPins(void){

    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);

	const port_pin_config_t port1_16_pinF6_config = {/* Internal pull-up resistor is enabled */
												kPORT_PullUp,
												/* Low internal pull resistor value is selected. */
												kPORT_LowPullResistor,
												/* Fast slew rate is configured */
												kPORT_FastSlewRate,
												/* Passive input filter is disabled */
												kPORT_PassiveFilterDisable,
												/* Open drain output is disabled */
												kPORT_OpenDrainDisable,
												/* Low drive strength is configured */
												kPORT_LowDriveStrength,
												/* Pin is configured as I3C1_SDA */
												kPORT_MuxAlt10,
												/* Digital input enabled */
												kPORT_InputBufferEnable,
												/* Digital input is not inverted */
												kPORT_InputNormal,
												/* Pin Control Register fields [15:0] are not locked */
												kPORT_UnlockRegister};
											/* PORT1_16 (pin F6) is configured as I3C1_SDA */
PORT_SetPinConfig(PORT1, 16U, &port1_16_pinF6_config);

const port_pin_config_t port1_17_pinF4_config = {/* Internal pull-up resistor is enabled */
                                                 kPORT_PullUp,
                                                 /* Low internal pull resistor value is selected. */
                                                 kPORT_LowPullResistor,
                                                 /* Fast slew rate is configured */
                                                 kPORT_FastSlewRate,
                                                 /* Passive input filter is disabled */
                                                 kPORT_PassiveFilterDisable,
                                                 /* Open drain output is disabled */
                                                 kPORT_OpenDrainDisable,
                                                 /* Low drive strength is configured */
                                                 kPORT_LowDriveStrength,
                                                 /* Pin is configured as I3C1_SCL */
                                                 kPORT_MuxAlt10,
                                                 /* Digital input enabled */
                                                 kPORT_InputBufferEnable,
                                                 /* Digital input is not inverted */
                                                 kPORT_InputNormal,
                                                 /* Pin Control Register fields [15:0] are not locked */
                                                 kPORT_UnlockRegister};
/* PORT1_17 (pin F4) is configured as I3C1_SCL */
PORT_SetPinConfig(PORT1, 17U, &port1_17_pinF4_config);
}

void LPI3C_DeinitPins(void){

    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);

	const port_pin_config_t port1_16_pinF6_config = {/* Internal pull-up resistor is enabled */
												kPORT_PullUp,
												/* Low internal pull resistor value is selected. */
												kPORT_LowPullResistor,
												/* Fast slew rate is configured */
												kPORT_FastSlewRate,
												/* Passive input filter is disabled */
												kPORT_PassiveFilterDisable,
												/* Open drain output is disabled */
												kPORT_OpenDrainDisable,
												/* Low drive strength is configured */
												kPORT_LowDriveStrength,
												/* Pin is configured as I3C1_SDA */
												kPORT_MuxAlt0,
												/* Digital input enabled */
												kPORT_InputBufferEnable,
												/* Digital input is not inverted */
												kPORT_InputNormal,
												/* Pin Control Register fields [15:0] are not locked */
												kPORT_UnlockRegister};
/* PORT1_16 (pin F6) is configured as I3C1_SDA */
PORT_SetPinConfig(PORT1, 16U, &port1_16_pinF6_config);

const port_pin_config_t port1_17_pinF4_config = {/* Internal pull-up resistor is enabled */
                                                 kPORT_PullUp,
                                                 /* Low internal pull resistor value is selected. */
                                                 kPORT_LowPullResistor,
                                                 /* Fast slew rate is configured */
                                                 kPORT_FastSlewRate,
                                                 /* Passive input filter is disabled */
                                                 kPORT_PassiveFilterDisable,
                                                 /* Open drain output is disabled */
                                                 kPORT_OpenDrainDisable,
                                                 /* Low drive strength is configured */
                                                 kPORT_LowDriveStrength,
                                                 /* Pin is configured as I3C1_SCL */
                                                 kPORT_MuxAlt0,
                                                 /* Digital input enabled */
                                                 kPORT_InputBufferEnable,
                                                 /* Digital input is not inverted */
                                                 kPORT_InputNormal,
                                                 /* Pin Control Register fields [15:0] are not locked */
                                                 kPORT_UnlockRegister};
/* PORT1_17 (pin F4) is configured as I3C1_SCL */
PORT_SetPinConfig(PORT1, 17U, &port1_17_pinF4_config);
}

